export function CareerContentItem() {
  return (
    <div className='flex flex-[4_0_0] flex-col gap-8'>
      <div className='flex flex-col gap-1'>
        <p>(주)위크루트</p>
        <p>2021.10. - 2025.03.(4년 • 정규직)</p>
      </div>
      <p>
        안녕하세요! 저는 프론트엔드 개발자 류현욱입니다. 항상 새로운 기술과 트렌드에 대한 호기심을 가지고 발전해
        나가고자 노력하고 있습니다. 저는 팀워크를 중요하게 생각하며, 특히 회의에서 서로의 의견이 잘 통합될 수 있도록
        항상 신중하게 대화에 참여합니다. 동상이몽이 되지 않도록 서로의 생각을 존중하고, 열린 마음으로 다양한 관점을
        받아들이는 데 중점을 두고 있습니다. 협업을 통해 더 나은 결과물을 만들어내는 것이 저의 목표입니다. 또한, 생각의
        유연성을 잃지 않으려 노력합니다. 기술적인 도전과 문제 해결에 있어서는 언제나 여러 가지 접근 방식을 고려하려고
        노력합니다. 실패는 항상 고통스럽지만, 거기서 배우며 성장하는 것이 중요하다고 믿고 있습니다.
      </p>
    </div>
  );
}
